title: Ransomware - Locky Payment Site Domain Blacklist
description: Detects blacklisted Locky Payment Site domains
author: Yulli Chong - InfoSec Innovations
date: 2019/01/11
status: experimental
references:
    - https://ransomwaretracker.abuse.ch/blocklist/
logsource:
    category:
        - webserver
        - proxy
detection:
    selection:
        domain:
          - jhomitevd2abj3fk.onion.to
          - f5xraa2y2ybtrefz.onion.to
          - zjfq4lnfbs7pncr5.onion.to
          - zjfq4lnfbs7pncr5.tor2web.org
          - mphtadhci5mrdlju.onion.to
          - mphtadhci5mrdlju.tor2web.org
          - mphtadhci5mrdlju.onion.to
          - 25z5g623wpqpdwis.onion.to
          - 32kl2rwsjvqjeui7.tor2web.org
          - 32kl2rwsjvqjeui7.onion.cab
          - 32kl2rwsjvqjeui7.onion.to
          - i3ezlvkoi7fwyood.tor2web.org
          - i3ezlvkoi7fwyood.onion.to
          - lpholfnvwbukqwye.onion.cab
          - lpholfnvwbukqwye.onion.to
          - twbers4hmi6dc65f.onion.cab
          - twbers4hmi6dc65f.onion.to
          - twbers4hmi6dc65f.tor2web.org
          - 6dtxgqam4crv6rr6.onion.cab
          # 19 entries
    condition: selection
fields:
    - domain
    - dns
falsepositives:
    - Unknown
level: high
