title: Whitelist TLS 1.2 and above
description: Detects requests for anything other than TLS 1.2 and above
author: Yulli Chong - InfoSec Innovations
date: 2019/01/11
status: experimental
references:
    - https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet
logsource:
    category:
        - webserver
        - proxy
        - ssl
        - tls
detection:
    selection:
          keyword:
            #CIPHER WHITELIST
            - 'DHE-RSA-AES256-GCM-SHA384'
            - 'DHE-RSA-AES128-GCM-SHA256'
            - DHE-RSA-AES256-SHA256
            - DHE-RSA-AES128-SHA256
            - ECDHE-RSA-AES256-GCM-SHA384
            - ECDHE-RSA-AES128-GCM-SHA256
            - ECDHE-RSA-AES256-SHA384
            - ECDHE-RSA-AES128-SHA256
            - ECDHE-RSA-AES256-SHA
            - ECDHE-RSA-AES128-SHA
            - AES256-GCM-SHA384
            - AES128-GCM-SHA256
            - AES256-SHA256
            - AES128-SHA256
            - AES256-SHA
            - AES128-SHA
            - DES-CBC3-SHA
            - DHE-RSA-AES256-SHA
            - DHE-RSA-AES128-SHA
            #PROTOCOL
            - 'TLSv1.2'
            - 'SSLv3'
            - 'TLSv1.2'
    condition: selection
fields:
    - Protocol
    - cipher
falsepositives:
    - Unknown
tags:
level: high
