action: global
title: lokibot malware
description: Detects lokibot malware activity
author: Yulli Chong - Infosec Innovations
date: 2019/01/11
status: experimental
references:
    - https://isc.sans.edu/forums/diary/Malspam+pushing+Lokibot+malware/24372/
detection:
    selection1:
        network traffic:
            - 185.83.215.*
            - 199.192.27.*
        host:
            - a.doko.moe
            - decvit.ga
        download:
            - GET /tkencn.jpg
            - POST /and/cat/php
    condition: 1 of them
falsepositives:
    - Unknown
level: critical
---
#on Windows Host
logsource:
    product: windows
detection:
    selection1:
        # attached Excel spreadsheet with macro to retrieve Lokibot
        SHA256 hash: 58cea3c44da13386b5acfe0e11cf8362a366e7b91bf9fc1aad7061f68223c5a8
        File size: 853,504 bytes
        File Name: 62509871.xls

    selection2:
        # Lokibot malware binary
        SHA256 hash: b8b6ee5387befd762ecce0e146bd0a6465239fa0785869f05fa58bdd25335d3e
        File size: 853,504 bytes
        File location:
            - hxxps://a.doko.moe/tkencn.jpg
            - C:\Users\[username]\AppData\Roaming\44631D\D1B132.exe
            - C:\Users\[username]\AppData\Roaming\sticik\stickiy.exe #deletes itself during infection

    condition: selection
